In [2]:
import pandas as pd

tbl0 = pd.read_csv("tbl0.tsv", sep="\t")
tbl1 = pd.read_csv("tbl1.tsv", sep="\t")
tbl2 = pd.read_csv("tbl2.tsv", sep="\t")

In [ ]:
def pregunta_01():
    """
    ¿Cuál es la cantidad de filas en la tabla `tbl0.tsv`?

    Rta/
    40

    """
    #la importacion de pandas permite la lectura de archivos csv directamente como "data frames" de ahi que podamos aplicar
    # metodos y funciones propios de objetos directamente a la variable que contiene los datos sin tener que recorrerla.
    #el truco es que se entiende cada elemento de la base de datos como un elemento con un tipo determinado
    # y no como strings o cadenas de texto

    len_t=len(tbl0)
    return len_t
pregunta_01()

40

In [ ]:
def pregunta_02():
    """
    ¿Cuál es la cantidad de columnas en la tabla `tbl0.tsv`?

    Rta/
    4

    """
    #el metodo .shape devuelve una tupla (fila, columnas) del archivo csv, por lectura de tuplas si solo
    # se necesitan las columnas, solo se necesita tomar el elemento 2 de la tupla generada por .shape 
    cant_col=tbl0.shape

    return cant_col[1]
pregunta_02()

4

In [ ]:
#para saber el nombre de las columnas se usa el metodo .columns, genera una tupla index(lista de nombres, lista de types)
#Hagase enfasis en "lista". Por lo tanto al primer elemento generado por .columns se le puede aplicar métodos de listas.
tbl0.columns

Index(['_c0', '_c1', '_c2', '_c3'], dtype='object')

In [ ]:
#el metodo .head() y .tail() traen por defecto los primeros o los ultimos 5 registros de la tabla
# el parametro n es igual a 5 por defecto e indica la cantidad de registros de la cabecera o la cola que se generan
# cuando el parametro n es negativo al generar la informacion omite los n ultimos registros generados (head) o los
#n primeros registros (tail)
# ambos metodos pueden combinarse
tbl0.head(n=7).tail(n=-5)

   _c0 _c1  _c2         _c3
5    5   A    7  1998-07-28
6    6   A    9  1997-02-28

In [123]:
def pregunta_03():
    """
    ¿Cuál es la cantidad de registros por cada letra de la columna _c1 del archivo
    `tbl0.tsv`?

    Rta/
    A     8
    B     7
    C     5
    D     6
    E    14
    Name: _c1, dtype: int64

    """
    conteo_c1=tbl0._c1.sort_values()
    conteo_c1= conteo_c1.value_counts(sort= False)
    
    
    return  conteo_c1
    
pregunta_03()

A     8
B     7
C     5
D     6
E    14
Name: _c1, dtype: int64

In [98]:
def pregunta_04():
    """
    Calcule el promedio de _c2 por cada letra de la _c1 del archivo `tbl0.tsv`.

    Rta/
    A    4.625000
    B    5.142857
    C    5.400000
    D    3.833333
    E    4.785714
    Name: _c2, dtype: float64
    """
    meanc2= tbl0.groupby("_c1")["_c2"].mean()
    return meanc2
    
pregunta_04()

_c1
A    4.625000
B    5.142857
C    5.400000
D    3.833333
E    4.785714
Name: _c2, dtype: float64

In [99]:

def pregunta_05():
    """
    Calcule el valor máximo de _c2 por cada letra en la columna _c1 del archivo
    `tbl0.tsv`.

    Rta/
    _c1
    A    9
    B    9
    C    9
    D    7
    E    9
    Name: _c2, dtype: int64
    """

    max_c2= tbl0.groupby("_c1")["_c2"].max()

    return max_c2

pregunta_05()

_c1
A    9
B    9
C    9
D    7
E    9
Name: _c2, dtype: int64

In [ ]:
def pregunta_06():
    """
    Retorne una lista con los valores unicos de la columna _c4 de del archivo `tbl1.csv`
    en mayusculas y ordenados alfabéticamente.

    Rta/
    ['A', 'B', 'C', 'D', 'E', 'F', 'G']

    """

    col4= [x.upper() for x in tbl1._c4]
    val_unico= sorted(set(col4))
    
    return val_unico
    

pregunta_06()

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [101]:
def pregunta_07():
    """
    Calcule la suma de la _c2 por cada letra de la _c1 del archivo `tbl0.tsv`.

    Rta/
    _c1
    A    37
    B    36
    C    27
    D    23
    E    67
    Name: _c2, dtype: int64
    """

    suma_c2=tbl0.groupby("_c1")["_c2"].sum()
    return suma_c2

pregunta_07()

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

In [162]:
def pregunta_08():
    """
    Agregue una columna llamada `suma` con la suma de _c0 y _c2 al archivo `tbl0.tsv`.

    Rta/
        _c0 _c1  _c2         _c3  suma
    0     0   E    1  1999-02-28     1
    1     1   A    2  1999-10-28     3
    2     2   B    5  1998-05-02     7
    ...
    37   37   C    9  1997-07-22    46
    38   38   E    1  1999-09-28    39
    39   39   E    5  1998-01-26    44

    """
#
# Una nueva columna
#
    tb_nuevo=tbl0.assign(suma=tbl0._c0 +tbl0._c2)

    return tb_nuevo
       
pregunta_08()

    _c0 _c1  _c2         _c3  suma
0     0   E    1  1999-02-28     1
1     1   A    2  1999-10-28     3
2     2   B    5  1998-05-02     7
3     3   A    3  1999-08-28     6
4     4   C    6  1999-12-01    10
5     5   A    7  1998-07-28    12
6     6   A    9  1997-02-28    15
7     7   B    1  1999-05-10     8
8     8   E    2  1997-04-12    10
9     9   B    3  1999-11-23    12
10   10   C    7  1998-01-17    17
11   11   C    5  1998-12-28    16
12   12   D    3  1999-10-15    15
13   13   E    8  1998-11-01    21
14   14   B    9  1999-08-12    23
15   15   D    1  1997-12-01    16
16   16   E    3  1997-07-28    19
17   17   D    5  1998-08-12    22
18   18   E    8  1999-08-24    26
19   19   E    9  1998-01-23    28
20   20   E    7  1999-06-22    27
21   21   E    3  1999-04-24    24
22   22   D    5  1999-06-25    27
23   23   A    1  1999-08-25    24
24   24   E    4  1997-07-26    28
25   25   E    6  1997-09-24    31
26   26   A    8  1997-09-28    34
27   27   E    5  1999-06-22    32
28   28   A    6  1999-07-29    34
29   29   C    0  1999-08-22    29
30   30   A    1  1998-04-26    31
31   31   D    2  1998-02-24    33
32   32   E    5  1999-03-24    37
33   33   B    4  1998-03-23    37
34   34   B    6  1999-04-21    40
35   35   D    7  1999-02-29    42
36   36   B    8  1997-05-21    44
37   37   C    9  1997-07-22    46
38   38   E    1  1999-09-28    39
39   39   E    5  1998-01-26    44

In [274]:
def pregunta_09():
    """
    Agregue el año como una columna al archivo `tbl0.tsv`.

    Rta/
        _c0 _c1  _c2         _c3  year
    0     0   E    1  1999-02-28  1999
    1     1   A    2  1999-10-28  1999
    2     2   B    5  1998-05-02  1998
    ...
    37   37   C    9  1997-07-22  1997
    38   38   E    1  1999-09-28  1999
    39   39   E    5  1998-01-26  1998

    """
    fechas=pd.to_datetime(tbl0._c3,infer_datetime_format=True, errors= "ignore" )
    años=[(x[:4]) for x in fechas]
    tb_nuevo=tbl0.assign(year=años)
    
    return tb_nuevo
pregunta_09()

    _c0 _c1  _c2         _c3  year
0     0   E    1  1999-02-28  1999
1     1   A    2  1999-10-28  1999
2     2   B    5  1998-05-02  1998
3     3   A    3  1999-08-28  1999
4     4   C    6  1999-12-01  1999
5     5   A    7  1998-07-28  1998
6     6   A    9  1997-02-28  1997
7     7   B    1  1999-05-10  1999
8     8   E    2  1997-04-12  1997
9     9   B    3  1999-11-23  1999
10   10   C    7  1998-01-17  1998
11   11   C    5  1998-12-28  1998
12   12   D    3  1999-10-15  1999
13   13   E    8  1998-11-01  1998
14   14   B    9  1999-08-12  1999
15   15   D    1  1997-12-01  1997
16   16   E    3  1997-07-28  1997
17   17   D    5  1998-08-12  1998
18   18   E    8  1999-08-24  1999
19   19   E    9  1998-01-23  1998
20   20   E    7  1999-06-22  1999
21   21   E    3  1999-04-24  1999
22   22   D    5  1999-06-25  1999
23   23   A    1  1999-08-25  1999
24   24   E    4  1997-07-26  1997
25   25   E    6  1997-09-24  1997
26   26   A    8  1997-09-28  1997
27   27   E    5  1999-06-22  1999
28   28   A    6  1999-07-29  1999
29   29   C    0  1999-08-22  1999
30   30   A    1  1998-04-26  1998
31   31   D    2  1998-02-24  1998
32   32   E    5  1999-03-24  1999
33   33   B    4  1998-03-23  1998
34   34   B    6  1999-04-21  1999
35   35   D    7  1999-02-29  1999
36   36   B    8  1997-05-21  1997
37   37   C    9  1997-07-22  1997
38   38   E    1  1999-09-28  1999
39   39   E    5  1998-01-26  1998

In [282]:
def pregunta_10():
    """
    Construya una tabla que contenga _c1 y una lista separada por ':' de los valores de
    la columna _c2 para el archivo `tbl0.tsv`.

    Rta/
                                   _c1
      _c0
    0   A              1:1:2:3:6:7:8:9
    1   B                1:3:4:5:6:8:9
    2   C                    0:5:6:7:9
    3   D                  1:2:3:5:5:7
    4   E  1:1:2:3:3:4:5:5:5:6:7:8:8:9
    """
    
 
    _c0=[letras for letras in tbl0._c1 ]
    _c1=[]
    datos=[]
    _c0= sorted(set(_c0))
    
    valores=""
    
    for y in _c0:
      for x in sorted(tbl0._c2[tbl0['_c1'].str.contains(y)]):
        if valores=="":
          valores=str(x)
        else:
          valores = str(valores) +":"+str(x)      
      datos.append((y,valores))
      valores=""
    
    df4= pd.DataFrame(data=(datos), columns=("_c0","_c1"))
    
    return df4
     

pregunta_10()

  _c0                          _c1
0   A              1:1:2:3:6:7:8:9
1   B                1:3:4:5:6:8:9
2   C                    0:5:6:7:9
3   D                  1:2:3:5:5:7
4   E  1:1:2:3:3:4:5:5:5:6:7:8:8:9

In [325]:
def pregunta_10():
    """
    Construya una tabla que contenga _c1 y una lista separada por ':' de los valores de
    la columna _c2 para el archivo `tbl0.tsv`.

    Rta/
                                   _c1
      _c0
    0   A              1:1:2:3:6:7:8:9
    1   B                1:3:4:5:6:8:9
    2   C                    0:5:6:7:9
    3   D                  1:2:3:5:5:7
    4   E  1:1:2:3:3:4:5:5:5:6:7:8:8:9
    """
    #filtro de la base de datos las columnas 1 y 2

    datos= tbl0.filter(items=("_c1","_c2"))
    #para que los numeros salgan en orden, debo ordenar la base de dartos de acuerdo a los numeros en _c2
    datos=datos.sort_values("_c2")
    #convierto los valores de _c2 a string
    datos["_c2"]= datos["_c2"].astype(str)
    #creo la tabla con un groupby con c2 como valores, 
    # uso agregate para añadir a cada valor de c1 sus valores en c2 un diccionario que tenga los valores unidos con :
    tabla= datos.groupby(["_c1"],as_index=False).aggregate({"_c2":":".join})
    #establesco un  C1 como index
    tabla.set_index("_c1", inplace=True)
    
    return tabla

pregunta_10()

                             _c2
_c1
A                1:1:2:3:6:7:8:9
B                  1:3:4:5:6:8:9
C                      0:5:6:7:9
D                    1:2:3:5:5:7
E    1:1:2:3:3:4:5:5:5:6:7:8:8:9

In [49]:
def pregunta_11():
    """
    Construya una tabla que contenga _c0 y una lista separada por ',' de los valores de
    la columna _c4 del archivo `tbl1.tsv`.

    Rta/
        _c0      _c4
    0     0    b,f,g
    1     1    a,c,f
    2     2  a,c,e,f
    3     3      a,b
    ...
    37   37  a,c,e,f
    38   38      d,e
    39   39    a,d,f
    """
    datos=tbl1.sort_values("_c4")
    tabla=datos.groupby(["_c0"], as_index=False).aggregate({"_c4":",".join})
    
    return tabla.shape
pregunta_11()

(40, 2)

In [48]:
def pregunta_12():
    """
    Construya una tabla que contenga _c0 y una lista separada por ',' de los valores de
    la columna _c5a y _c5b (unidos por ':') de la tabla `tbl2.tsv`.

    Rta/
        _c0                                  _c5
    0     0        bbb:0,ddd:9,ggg:8,hhh:2,jjj:3
    1     1              aaa:3,ccc:2,ddd:0,hhh:9
    2     2              ccc:6,ddd:2,ggg:5,jjj:1
    ...
    37   37                    eee:0,fff:2,hhh:6
    38   38                    eee:0,fff:9,iii:2
    39   39                    ggg:3,hhh:8,jjj:5

    """
    _c5= [(x[1]+":"+str(x[2])) for x in tbl2.values]
    datos=tbl2.assign(_c5=_c5)
    datos=datos.sort_values("_c5")
    tabla=datos.groupby(("_c0"), as_index=False).aggregate({"_c5":",".join})

    return tabla.shape
pregunta_12()

(40, 2)

In [41]:
def pregunta_13():
    """
    Si la columna _c0 es la clave en los archivos `tbl0.tsv` y `tbl2.tsv`, compute la
    suma de tbl2._c5b por cada valor en tbl0._c1.

    Rta/
    _c1
    A    146
    B    134
    C     81
    D    112
    E    275
    Name: _c5b, dtype: int64

    """
    datos= pd.merge(tbl0,tbl2, on="_c0")
    suma_c5b=datos.groupby("_c1")["_c5b"].sum()
    return suma_c5b

pregunta_13()

_c1
A    146
B    134
C     81
D    112
E    275
Name: _c5b, dtype: int64